#include <iostream>
using namespace std;

const int n = 10;

int a[n][n] = {
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,1,1,0,0,0,0,0,0},
	{0,1,0,0,0,0,0,0,0,0},
	{0,1,0,0,1,0,0,0,0,0},
	{0,0,0,1,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0},
	{0,0,0,0,0,0,0,0,0,0}
};

bool v[10] = { false };

void search(int f) { // int t 없애고 for 문을 계속 0부터 돌려도 됨.

	if (f > n) return;

	for (int i = 0; i < n; i++) {
		if (a[f][i])
		{
			if (!v[f])
			{
				cout << f << '\n';
				v[f] = true;
				search(i);
			}
		}
	}
	search(f+1);

}

int main()
{
	search(0);

	return 0;
}

/*
문제 
0부터 9까지 총 10개 노드 (인접 행렬로 구현)
1-2 / 1-3 / 3-4
0부터 방문안한 노드를 찾고 해당 노드부터 방문, 연결된 노드를 이어서 방문해서 출력하는 재귀 함수를 만들어라.
*/
